In [2]:
import pandas as pd

In [3]:
ex = pd.read_excel("Excel_data.xlsx")
df = pd.DataFrame(ex)
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [4]:
df.isnull()

        ID   Name    Age  Profession  salary
0    False  False  False       False   False
1    False  False  False       False   False
2    False  False  False       False   False
3    False  False  False       False   False
4    False  False  False       False   False
..     ...    ...    ...         ...     ...
495  False  False  False       False   False
496  False  False  False       False   False
497  False  False  False       False   False
498  False  False  False       False   False
499  False  False  False       False   False

[500 rows x 5 columns]

In [5]:
df.isnull().sum()

ID            0
Name          0
Age           8
Profession    0
salary        0
dtype: int64

In [6]:
# delete the records with null values
df1 = df.copy()
df1 = df1.dropna()

In [8]:
df1.isnull().sum()

ID            0
Name          0
Age           0
Profession    0
salary        0
dtype: int64

In [9]:
df1.shape

(492, 5)

In [10]:
# Delete the column
df2 = df.copy()
df2 = df2.dropna(axis = 1)
df2

      ID       Name         Profession  salary
0      1     olivia            Teacher  184518
1      2  sophia                 Boxer  119572
2      3       jake          Scientist  174897
3      4      Rocky               Chef  117920
4      4      Rocky               Chef  117920
..   ...        ...                ...     ...
495  496       John              Boxer  137929
496  497   Sherlock              Boxer   39870
497  498   Sherlock          Detective  165951
498  499     Olivia           Comedian  192618
499  500   Sherlock  Software Engineer  194886

[500 rows x 4 columns]

In [12]:
df3 = df.copy()
mean = df3.Age.mean()
df3.Age = df3.Age.fillna(mean)

In [14]:
df3.isnull().sum()

ID            0
Name          0
Age           0
Profession    0
salary        0
dtype: int64